Tutorials/gasMixture/shockTubeTwoGases/constant/reactions
species
(
    He
    air
);

reactions
{
}
